# VSCraft
#
"""
задача:  https://projecteuler.net/problem=22
перевод: http://euler.jakumo.org/problems/view/22.html


Используйте [names.txt](https://projecteuler.net/project/resources/p022_names.txt) (щелкнуть правой кнопкой мыши и
выбрать 'Save Link/Target As...'), текстовый файл размером 46 КБ,
содержащий более пяти тысяч имен. Начните с сортировки в алфавитном порядке. Затем подсчитайте алфавитные
значения каждого имени и умножьте это значение на порядковый номер имени в отсортированном списке для получения
количества очков имени.

Например, если список отсортирован по алфавиту, имя COLIN (алфавитное значение которого 3 + 15 + 12 + 9 + 14 = 53)
 является 938-ым в списке. Поэтому, имя COLIN получает 938 × 53 = 49714 очков.

Какова сумма очков имен в файле?
"""
# solving ..

